Repository: KDE/kdebugsettings
Catalog: po/*/kdebugsettings.po
Languages: eo

source: Configure debug settings
eo: Agordi sencimigajn agordojn

source: (c) 2015-%1 kdebugsettings authors
eo: (c) 2015-%1 aŭtoroj de kdebugsettings

source: Maintainer
eo: Prizorganto

source: Enable QStandardPaths test mode, i.e. read/write settings used by unittests
eo: Ebligi QStandardPaths-testreĝimon, t.e. legi/skribi agordojn uzatajn de unutestoj

source: Activate full debug for all modules.
eo: Aktivigi plenan sencimigon por ĉiuj moduloj.

source: Disable full debug for all modules.
eo: Malebligi plenan sencimigon por ĉiuj moduloj.

source: Change debug mode as console (in console)
eo: Ŝanĝi sencimigan reĝimon kiel konzolon (en konzolo)

source: Specify logging category name that you want to change debug mode (in console)
eo: Specifu la nomon de la kategorio de protokolo, kiun vi volas ŝanĝi sencimigan reĝimon (en konzolo)

source: Impossible to change debug mode
eo: Neeble ŝanĝi sencimigan reĝimon

source: Full Debug
eo: Plena Sencimigo

source: Warning
eo: Averto

source: Critical
eo: Kritikaj

source: Off
eo: Malŝaltita

source: Undefined
eo: Nedifinita

source: Category name: %1
eo: Kategoria nomo: %1

source: Identifier: %1
eo: Identigilo: %1

source: Default Severity: %1
eo: Defaŭlta Severeco: %1

source: All Debug Messages
eo: Ĉiuj Sencimigaj Mesaĝoj

source: Info Messages
eo: Info Mesaĝoj

source: Warning Messages
eo: Avertaj Mesaĝoj

source: Debug Messages
eo: Sencimigi Mesaĝojn

source: Critical Messages
eo: Kritikaj Mesaĝoj

source: No Debug Messages
eo: Neniuj Sencimigaj Mesaĝoj

source: (c) %1 kdebugsettings authors
eo: (c) %1 aŭtoroj de kdebugsettings

source: A custom rule '*=true' or '*=false' is present, which may override more specific rules. It is better to remove it.
eo: Vi havas regulon kiel '*=true' aŭ '*=false' kiu superregos vian specifan regulon. Pli bone forigi ĝin.

# @title:window
source: Add custom rule
eo: Aldoni propran regulon

# @title:window
source: Edit custom rule
eo: Redakti propran regulon

source: Enable
eo: Ebligi

# @label:textbox
source: Category:
eo: Kategorio:

# @label:textbox
source: Type:
eo: Tipo:

source: Add Rule…
eo: Aldoni regulon…

source: Edit Rule
eo: Redakti Regulon

source: Remove Rule
eo: Forigi Regulon

source: Do you want to remove this rule?
eo: Ĉu vi volas forigi ĉi tiun regulon?

# @action:button
source: Edit…
eo: Redakti…

# @action:button
source: Remove…
eo: Forigi…

# @info:placeholder
source: Search…
eo: Serĉi…

# @action:button
source: Add…
eo: Aldoni…

source: No rules have been defined in the environment variable "QT_LOGGING_RULES".
eo: Neniuj reguloj estas difinitaj en la mediovariablo "QT_LOGGING_RULES".

source: These rules cannot be edited with this application. You need to set them in QT_LOGGING_RULES variable directly.
eo: Ĉi tiuj reguloj ne povas esti redaktitaj per ĉi tiu aplikaĵo. Vi devas agordi ilin rekte en QT_LOGGING_RULES-variablo.

source: Current rules:
eo: Nunaj reguloj:

# @title:window
source: Manage Group
eo: Administri Grupon

source: Export Group
eo: Eksporta Grupo

source: Group exported to %1
eo: Grupo eksportita al %1

source: Impossible to export group '%2' to '%1'
eo: Neeble eksporti grupon '%2' al '%1'

source: Rename Group
eo: Alinomigi Grupon

source: New Name:
eo: Nova Nomo:

source: Impossible to rename group as '%1'.
eo: Neeble renomi grupon kiel '%1'.

source: Rename Group…
eo: Alinomi Grupon…

source: Export Group…
eo: Elporti Grupon…

source: Remove Groups
eo: Forigi Grupojn

source: Impossible to remove '%1'
eo: Neeble forigi '%1'

source: Remove Group
eo: Forigi Grupon

# @action:button
source: Enable All Debug
eo: Ebligi Ĉian Sencimigon

# @action:button
source: Turn Off Debug
eo: Malŝalti Sencimigon

# @action:button
source: Turn Off All Messages
eo: Malŝalti Ĉiujn Mesaĝojn

source: KDE Application
eo: KDE-apliko

source: Custom Rules
eo: Propraj Reguloj

source: Rules Settings With Environment Variable
eo: Reguloj Agordoj Kun Media Variablo

source: Save As…
eo: Konservi kiel…

# @action:button
source: Insert…
eo: Enmeti…

source: '%1' cannot be opened. Please verify it.
eo: '%1' ne povas esti malfermita. Bonvolu konfirmi ĝin.

source: Insert Categories
eo: Enmeti Kategoriojn

source: Categories Files
eo: Kategorioj Dosieroj

source: Categories from file '%1' inserted.
eo: Kategorioj de dosiero '%1' enmetitaj.

source: Group Name
eo: Grupa Nomo

source: Name:
eo: Nomo:

source: <b>'%1'</b> is already used as a group name. Please save as another name.
eo: <b>'%1'</b> jam estas uzata kiel grupnomo. Bonvolu konservi kiel alia nomo.

source: Can not save as empty name. Please use a new one.
eo: Ne povas konservi kiel malplena nomo. Bonvolu uzi novan.

source: Save As
eo: Konservi kiel

source: KDebugSettings File (*.kdebugsettingsrules)
eo: Dosiero de KDebugSettings (*.kdebugsettingsrules)

source: Load Debug Settings Files
eo: Ŝargi Dosierojn pri Sencimigaj Agordoj

source: Load Group
eo: Ŝargi Grupon

source: Manage Group
eo: Administri Grupon

source: Load…
eo: Ŝargi…

source: Load From File…
eo: Ŝargi El Dosiero…

source: Save As File…
eo: Konservi Kiel Dosiero…

source: Save As Group…
eo: Konservi kiel grupo…
